pmo-dataset/variations/mermaid_with_ids/50.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["Claim is registered"]
	Task_2["Claim is examined by\na claims officer"]
	Task_3["Claims officer\nwrites a settlement\nrecommendation"]
	Task_4["Recommendation is\nchecked by a senior\nclaims officer"]
	Task_5["Senior claims\nofficer marks the\nclaim"]
	Task_6["Claim is sent back"]
	Task_7["Claim handling\nprocess proceeds"]
	StartNoneEvent_1((" "))
	EndNoneEvent_1((" ")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}

	StartNoneEvent_1 --> Task_1
	Task_1 --> Task_2
	Task_3 --> Task_4
	Task_4 --> Task_5
	Task_5 --> ExclusiveGateway_1
	Task_2 --> ExclusiveGateway_2
	ExclusiveGateway_2 --> Task_3
	Task_6 --> ExclusiveGateway_2
	ExclusiveGateway_1 -->|"OK"| Task_7
	ExclusiveGateway_1 -->|"Not OK"| Task_6
	Task_7 --> EndNoneEvent_1
